# -*- coding: utf-8 -*-

# Уровни
LEVELS = [
    "Новичок",
    "Полгода-год",
    "Больше двух лет",
]

# Инвентарь
EQUIPMENT = [
    "Толстая резинка (почти не можете растянуть руками)",
    "Тонкая резинка (можете растянуть руками)",
    "Маленькие гантели (1–2 кг)",
    "Разборные гантели",
    "Штанга",
    "Гиря",
    "Турник",
    "Брусья",
    "Trx-петли",
    "Спортзал с тренажерами",
    "Ничего",
]

# Ограничения
LIMITATIONS = [
    "Больные колени",
    "Межпозвоночные грыжи/протрузии",
    "Большой вес",
    "Нет ограничений",
]

# Группы мышц
MUSCLE_GROUPS = [
    "Спина",
    "Низ",
    "Грудь",
    "Живот",
    "Трицепсы",
    "Дельты (плечи)",
    "Икры",
]
# Длительность тренировки
DURATION_MINUTES = [15, 30, 45]

