# -*- coding: utf-8 -*-

# Уровни
LEVELS = [
    "Я новичок",
    "От нескольких месяцев до года",
    "Больше года",
]

# Инвентарь
EQUIPMENT = [
    "Толстая резинка (почти не можете растянуть руками)",
    "Тонкая резинка (можете растянуть руками)",
    "Маленькие гантели (1–2 кг)",
    "Разборные гантели",
    "Штанга",
    "Гиря",
    "Турник",
    "Брусья",
    "Trx-петли",
    "Спортзал с тренажерами",
    "Ничего",
]

# Ограничения
LIMITATIONS = [
    "Больные колени",
    "Межпозвоночные грыжи/протрузии",
    "Большой вес",
    "Нет ограничений",
]

# Группы мышц
MUSCLE_GROUPS = [
    "Спина",
    "Низ",
    "Грудь",
    "Живот",
    "Трицепсы",
    "Дельты (плечи)",
    "Икры",
]
# Длительность тренировки
DURATION = ["5-10", "15-20", "35-45"]

DURATION_DICT: dict[str, int] = {
    "5-10": 10,
    "15-20": 20,
    "35-45": 45,
}

