# -*- coding: utf-8 -*-

LEVELS = [
    "Я новичок",
    "От нескольких месяцев до года",
    "Больше года",
]

EQUIPMENT = [
    "Толстая резинка (почти не можете растянуть руками)",
    "Тонкая резинка (можете растянуть руками)",
    "Маленькие гантели (1–2 кг)",
    "Разборные гантели",
    "Штанга",
    "Гиря",
    "Турник",
    "Брусья",
    "Trx-петли",
    "Спортзал с тренажерами",
    "Ничего",
]

LIMITATIONS = [
    "Больные колени",
    "Межпозвоночные грыжи/протрузии",
    "Большой вес",
    "Нет ограничений",
]

MUSCLE_GROUPS = [
    "Спина",
    "Низ",
    "Грудь",
    "Живот",
    "Трицепсы",
    "Дельты (плечи)",
    "Икры",
]

EXTRA_MUSCLE_OPTIONS = [
    "Трицепсы",
    "Дельты (плечи)",
    "Икры",
    "Еще на спину",
    "Еще на низ",
    "Еще на живот",
    "Еще на грудь",
    "Нет, не надо",
]

DURATION = ["5-10", "15-20", "35-45"]
DURATION_BEGINNER = ["5-10", "15-20"]

DURATION_DICT: dict[str, int] = {
    "5-10": 10,
    "15-20": 20,
    "35-45": 45,
}

